
# # 1.1
# a = float(input("Введите сторону квадрата: "))
# p = 4 * a
# print("Периметр квадрата:", p)

# # 1.2
# a = float(input("Введите сторону квадрата: "))
# S = a ** 2
# print("Площадь квадрата:", S)

# # 1.3
# a = float(input("Введите длину прямоугольника: "))
# b = float(input("Введите ширину прямоугольника: "))
# S = a * b
# P = 2 * (a+b)
# print("Площадь прямоугольника равна: ", S)
# print("Периметр прямоугольника равен: ", P)

# # 1.4
# d = float(input("Введите диаметр окружности: "))
# p = 3.14
# L = p * d
# print("Длина окружности равна: ", L)

# # 1.5
# a = float(input("Введите длину ребра куба: "))
# V = a ** 3
# S = 6 * (a**2)
# print("Объем куба равен: ", V)
# print("Площадь поверхности куба равен: ", S)

# # 1.6
# a = float(input("Введите длину прямоугольного параллелепипеда: "))
# b = float(input("Введите ширину прямоугольного параллелепипеда:  "))
# c = float(input("Введите высоту прямоугольного параллелепипеда: "))
# V = a * b * c
# S = 2*((a*b)+(b*c)+(a*c))
# print("Объем прямоугольного параллелепипеда равен: ", V)
# print("Площадь поверхности прямоугольного параллелепипеда равна: ", S)

# # 1.7
# R = float(input("Введите радиус окружности: "))
# p = 3.14
# S = p * (R**2)
# L = 2 * p * R
# print("Длина окружности равна: " , L)
# print("Площадь круга равна: ", S)

# # 1.8
# a = float(input("Введите первое число: "))
# b = float(input("Введите второе число: "))
# S = (a + b)/2
# print("Среднее арифметическое: ", S)

# # 1.9
# a = float(input("Введите первое число: "))
# b = float(input("Введите второе число: "))
#
# if a < 0 or b < 0:
#     print("Введите положительные числа.")
#
# S = (a * b) ** 0.5
# print("Среднее геометрическое: ", S)

# # 1.10
# a = float(input("Введите первое число: "))
# b = float(input("Введите второе число: "))
#
# if a == 0 or b == 0:
#     print("Числа не должны быть равны нулю")
# else:
#     k_a = a**2
#     k_b = b**2
#
#     print("Сумма квадратов равна: ", k_a+k_b)
#     print("Разность квадратов равна: ", k_a-k_b)
#     print("Произведение квадратов: ", k_a*k_b)
#     print("Частность квадратов: ", k_a/k_b)