# # 5.1
# person = {
#     "имя": "Андрей",
#     "возраст": 20,
#     "пол": "мужской",
#     "рост": "185",
#     "вес": "75",
# }

# # 5.2
# person = {
#     "имя": "Андрей",
#     "возраст": 20,
#     "пол": "мужской",
#     "рост": 185,
#     "вес": 75,
# }
#
# print("Имя:",person["имя"])
# print("Возраст:",person["возраст"])
# print("Пол:",person["пол"])
# print("Рост:",person["рост"])
# print("Вес:",person["вес"])

# # 5.3
# person = {
#     "имя": "Андрей",
#     "возраст": 20,
#     "пол": "мужской",
#     "рост": 185,
#     "вес": 75,
# }
#
# person["Размер ноги"] = 45
#
# print(person)

# # 5.4
# person = {
#     "имя": "Андрей",
#     "возраст": 20,
#     "пол": "мужской",
#     "рост": 185,
#     "вес": 75,
# }
#
# del person["возраст"]
#
# print(person)